# GIT - это распределенная система контроля версий
# Это система для отслеживания и ведения истории изменения файлов в нашем проекте. При помощи git можно организовать командную работу.

# GitHub - это веб-сайт для размещения git-репозиториев в совместной разработке проектов.

# Репозиторий - это хранилище нашего кода и истории его изменений

# Команды GIT:
# 1. git init - создает удаленный репозиторий в той дериктории в которой было прописана команда
# 2. git add - комманда для добавлений изменнений в систему отслеживания гита 
# 3. git commit -m 'something' - это команда для сохранений изменения всех изменений на main
# 4. git branch - main - это команда переименовывает главную ветку master на main.
# 5. git remote add origin 'url" - эта команда связывает наш локальный репозиторий с удаленным репозиторием на гитхаре
# 6. git push origin main>-команда отправки наших изменений на удаленный репозиторий.

#================================================================================================
# git status показывает статус репозитория (какие изменения не закомичены)
# git branch показывает